results/dev-dax/rw_all/dev-dax.txt
dev-dax-write: (g=0): rw=randwrite, bs=2048KiB-2048KiB,2048KiB-2048KiB,2048KiB-2048KiB, ioengine=dev-dax, iodepth=1
dev-dax-read: (g=1): rw=randread, bs=2048KiB-2048KiB,2048KiB-2048KiB,2048KiB-2048KiB, ioengine=dev-dax, iodepth=1
fio-2.17-35-ge28d1
Starting 2 threads

dev-dax-write: (groupid=0, jobs=1): err= 0: pid=9135: Fri Feb  3 14:04:36 2017
  write: IOPS=3706, BW=7414MiB/s (7774MB/s)(217GiB/30001msec)
    clat (usec): min=216, max=3562, avg=229.63, stdev=44.21
     lat (usec): min=242, max=3588, avg=268.85, stdev=48.99
    clat percentiles (usec):
     |  1.00th=[  223],  5.00th=[  225], 10.00th=[  225], 20.00th=[  225],
     | 30.00th=[  227], 40.00th=[  227], 50.00th=[  227], 60.00th=[  229],
     | 70.00th=[  229], 80.00th=[  229], 90.00th=[  231], 95.00th=[  233],
     | 99.00th=[  270], 99.50th=[  302], 99.90th=[  596], 99.95th=[  748],
     | 99.99th=[ 3152]
   bw (  MiB/s): min=  574, max= 9481, per=0.12%, avg=8965.16, stdev=364.25
    lat (usec) : 250=98.26%, 500=1.54%, 750=0.15%, 1000=0.03%
    lat (msec) : 2=0.01%, 4=0.02%
  cpu          : usr=99.17%, sys=0.29%, ctx=63, majf=0, minf=53067
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,111210,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
dev-dax-read: (groupid=1, jobs=1): err= 0: pid=9161: Fri Feb  3 14:04:36 2017
   read: IOPS=2991, BW=5983MiB/s (6273MB/s)(175GiB/30001msec)
    clat (usec): min=291, max=1279, avg=332.10, stdev=26.12
     lat (usec): min=291, max=1280, avg=332.22, stdev=26.13
    clat percentiles (usec):
     |  1.00th=[  310],  5.00th=[  314], 10.00th=[  318], 20.00th=[  322],
     | 30.00th=[  326], 40.00th=[  326], 50.00th=[  330], 60.00th=[  334],
     | 70.00th=[  338], 80.00th=[  342], 90.00th=[  346], 95.00th=[  350],
     | 99.00th=[  378], 99.50th=[  422], 99.90th=[  884], 99.95th=[  956],
     | 99.99th=[ 1096]
   bw (  MiB/s): min= 1601, max= 7037, per=0.10%, avg=6186.30, stdev=278.82
    lat (usec) : 500=99.83%, 750=0.06%, 1000=0.09%
    lat (msec) : 2=0.03%
  cpu          : usr=98.82%, sys=0.55%, ctx=42, majf=0, minf=47048
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=89743,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=7414MiB/s (7774MB/s), 7414MiB/s-7414MiB/s (7774MB/s-7774MB/s), io=217GiB (233GB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=5983MiB/s (6273MB/s), 5983MiB/s-5983MiB/s (6273MB/s-6273MB/s), io=175GiB (188GB), run=30001-30001msec